Revit 2026 API

# ValueAtPointBaseSetFlags(IListInt32) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFlags(
	IList<int> flags
)
```
```vb
Public Sub SetFlags (
	flags As IList(Of Integer)
)
```
```cpp
public:
void SetFlags(
	IList<int>^ flags
)
```
```fsharp
member SetFlags :
        flags : IList<int> -> unit
```

#### Parameters

flags IListInt32

#### Reference

ValueAtPointBase Class

SetFlags Overload

Autodesk.Revit.DB Namespace